[
    {
        "id": 1,
        "name": "Mark Wilson",
        "email": "mwilson@example.com",
        "subject": "Question about volunteer opportunities",
        "message": "Hello, I'm interested in volunteering but have limited availability due to my work schedule. Do you have any weekend-only opportunities available? I'm particularly interested in environmental conservation or community garden projects. Thank you for your help!",
        "organization_id": "",
        "submission_date": "2023-01-12 14:22:35",
        "status": "new"
    },
    {
        "id": 2,
        "name": "Sophia Patel",
        "email": "spatel@example.com",
        "subject": "Volunteering as a group",
        "message": "I'm coordinating a team-building activity for my company and we're interested in volunteering together as a group of 12 people. Do you have any one-time project opportunities where we could all work together? We're available on March 15th and would be able to commit about 4 hours. Thank you for any suggestions!",
        "organization_id": "",
        "submission_date": "2023-01-18 09:15:42",
        "status": "responded"
    },
    {
        "id": 3,
        "name": "James Lee",
        "email": "jlee@example.com",
        "subject": "Technical issue with application form",
        "message": "I tried to submit an application for the Youth Mentor position, but received an error message when I clicked submit. I've tried on both Chrome and Firefox browsers but am experiencing the same issue. Can you please help me troubleshoot this or provide an alternative way to apply? Thank you.",
        "organization_id": "",
        "submission_date": "2023-01-25 16:30:21",
        "status": "resolved"
    },
    {
        "id": 4,
        "name": "Maria Garcia",
        "email": "mgarcia@example.com",
        "subject": "Interest in partnering with Happy Tails Animal Rescue",
        "message": "I work for a local pet supply store and we're interested in potentially partnering with Happy Tails Animal Rescue for adoption events and fundraising opportunities. Could someone from the organization contact me to discuss collaboration possibilities? We'd love to support your mission in any way we can.",
        "organization_id": "4",
        "submission_date": "2023-02-02 13:45:18",
        "status": "forwarded"
    },
    {
        "id": 5,
        "name": "Daniel Kim",
        "email": "dkim@example.com",
        "subject": "Volunteer opportunities for teenagers",
        "message": "My daughter is 16 years old and looking for volunteer opportunities to fulfill her high school community service requirement. Are there any positions suitable for teenagers, particularly in education or animal welfare? She's very responsible and eager to contribute. Thank you for your assistance.",
        "organization_id": "",
        "submission_date": "2023-02-10 10:12:53",
        "status": "new"
    }
    
]